Revit 2026 API

# FilterValueRule Properties

---

The FilterValueRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from FilterRule) |

#### Reference

FilterValueRule Class

Autodesk.Revit.DB Namespace